Revit 2027 API
ImageInstance.DrawLayer Property
 The layer the ImageInstance will be drawn in.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DrawLayer DrawLayer { get; set; }
Public Property DrawLayer As DrawLayer
	Get
	Set
public:
property DrawLayer DrawLayer {
	DrawLayer get ();
	void set (DrawLayer value);
}
member DrawLayer : DrawLayer with get, set
Property Value
DrawLayer
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ImageInstance Class
Autodesk.Revit.DB Namespace